In [1]:
import os
import pandas as pd
from typing import Optional, Sequence, Union

pd.set_option('display.max_columns', None)

from core import *

In [2]:
df = load_data(r'D:\Documents\Python\CREATE_DATA\airline_names.xlsx')

In [3]:
df3 = pd.DataFrame({'A':[1,2,7,None,6,9],'B':[6,2,5,1,2,9] })
profile(df3)

ROW TOTAL = 6 COLUMNS = 2

,Variable Name,Variable Type,Missing Count,% Blank,Unique Values,Most Frequent Value,Mean,Standard Deviation,Min,25%,Median,75%,Max
0,A,float64,1,17,5,1.0,5.00,3.39,1.0,2.0,6.0,7.00,9.0
1,B,int64,0,0,5,2.0,4.17,3.06,1.0,2.0,3.5,5.75,9.0

In [5]:
#df = df[['operating_airline','published_airline']]
#df = df[['activity_period']]  
df.head()

  operating_airline operating_airline2
0      ATA Airlines       ATA Airlines
1      ATA Airlines       ATA Airlines
2      ATA Airlines       ATA Airlines
3        Air Canada         Air Canada
4        Air Canada         Air Canada

In [16]:
profile(df)

ROW TOTAL = 22,869 COLUMNS = 2

,Variable Name,Variable Type,Missing Count,% Blank,Unique Values,Most Frequent Value
0,operating_airline,object,0,0,95,United Airlines
1,operating_airline2,object,4868,21,84,United Airlines - Pre 07/01/2013

In [14]:
df2 = load_data(r'D:\Documents\Python\CREATE_DATA\winemag-data_first150k.csv')

In [ ]:
profile(df2)

ROW TOTAL = 150,930 COLUMNS = 10

,Variable Name,Variable Type,Missing Count,% Blank,Unique Values,Most Frequent Value,Mean,Standard Deviation,Min,25%,Median,75%,Max
0,country,object,5,0,48,US,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,description,object,0,0,97821,"86-88 This could work as a rich wine, because ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,designation,object,45735,30,30620,Reserve,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,points,int64,0,0,21,87,87.89,3.22,80.0,86.0,88.0,90.0,100.0
4,price,float64,13695,9,357,20.0,33.13,36.32,4.0,16.0,24.0,40.0,2300.0
5,province,object,5,0,455,California,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,region_1,object,25060,17,1236,Napa Valley,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,region_2,object,89977,60,18,Central Coast,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,variety,object,0,0,632,Chardonnay,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,winery,object,0,0,14810,Williams Selyem,NaN,NaN,NaN,NaN,NaN,NaN,NaN

---
Profile testing above.